app/controllers/merchants_controller.rb

SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)
---
  def show
    @merchant = Merchant.find(params[:id])

SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)
---
  def edit
    @merchant = Merchant.find(params[:id])

SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)
UPDATE `merchants` SET `updated_at` = '2010-08-28 05:02:52', `image_path` = 'http://alamodeonline.com/Images/Logo.gif' WHERE `id` = 1
---
  def update
    @merchant = Merchant.find(params[:id])

    respond_to do |format|
      if @merchant.update_attributes(params[:merchant])

SELECT * FROM `reviews` WHERE (`reviews`.merchant_id = 1)
SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)
---
  def public
  	@reviews = Review.find(:all, :order => 'position DESC')
  	@merchant = Merchant.find(params[:id])