app/controllers/public_controller.rb

INSERT INTO `users` (`created_at`, `updated_at`, `last_name`, `password`, `image_path`, `email`, `first_name`) VALUES('2010-08-28 04:58:10', '2010-08-28 04:58:10', 'Lin', 'lin', 'http://www.eng.uc.edu/dept_cme/facultystaff/faculty/images/raylin.jpg', 'raytlin@gmail.com', 'Ray')
---
  def send_signup
  	@user = User.new(params[:user])
  	if @user.save

INSERT INTO `merchants` (`name`, `address`, `city`, `zip`, `created_at`, `updated_at`, `web_address`, `image_path`, `state`) VALUES('Alamode', '10152 Chapman Ave', 'Garden Grove', 92840, '2010-08-28 04:58:50', '2010-08-28 04:58:50', 'alamodeonline.com', NULL, 'CA')
---
  def send_merchant
  	@merchant = Merchant.new(params[:merchant])
  	@merchant.image_path = "http://localthaifood.moxyfy.com/images/default_avatar.gif"
	if @merchant.save

SELECT * FROM `reviews` WHERE (`reviews`.`id` = 1)
UPDATE `reviews` SET `updated_at` = '2010-08-30 09:39:10', `position` = 1 WHERE `id` = 1
---
   def rank_up
  	@review = Review.find(params[:id])
  	@review.position = @review.position + 1
  	if @review.update_attributes(params[:review])

SELECT * FROM `reviews` WHERE (`reviews`.`id` = 1)
UPDATE `reviews` SET `updated_at` = '2010-08-30 09:33:49', `position` = -1 WHERE `id` = 2
---
  def rank_down
  	@review = Review.find(params[:id])
  	@review.position = @review.position - 1
  	if @review.update_attributes(params[:review])