app/controllers/reviews_controller.rb

  def show
    @review = Review.find(params[:id])
---
SELECT * FROM `reviews` WHERE (`reviews`.`id` = 1)

  def edit
    @review = Review.find(params[:id])
---
SELECT * FROM `reviews` WHERE (`reviews`.`id` = 1)

  def create
    @review = Review.new(params[:review])
    @review.position = 0

    respond_to do |format|
      if @review.save
---
INSERT INTO `reviews` (`comment`, `position`, `created_at`, `updated_at`, `user_id`, `score`, `merchant_id`) VALUES('adsfg', 0, '2010-08-30 09:42:57', '2010-08-30 09:42:57', 1, 3, 2)

  def public
  	if session[:user_id]
	  	@review = Review.new
		@merchant = Merchant.find(params[:id])
		@merchants = Merchant.find(:all)
		@review.merchant_id = @merchant.id
		@user = User.find(session[:user_id])
---
SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create_public

  	@review = Review.new(params[:review])
  	@review.user_id = session[:user_id]
  	@review.position = 0
  	@reviews = Review.find(:all)
  	user_id = @review.user_id
  	merchant_id = @review.merchant_id

 	if Review.find(:first, :conditions => ["user_id = ? AND merchant_id = ?", user_id, merchant_id])
  		flash[:notice] = "you have already written a review for this guy!"
  		redirect_to(:controller => 'merchants', :action => 'public', :id => merchant_id )
  	else
	  	if @review.save
---
SELECT * FROM `reviews` WHERE (user_id = 1 AND merchant_id = 1) LIMIT 1
INSERT INTO `reviews` (`comment`, `created_at`, `updated_at`, `user_id`, `score`, `merchant_id`) VALUES('This is the best ring place in town! They have great prices since they have a pretty decent bulk discount rate. The policy is kind of hidden in there but they\'ll give you the discount even if you don\'t ask for it. One warning though, special orders can take a few weeks but in stock items always ship quick!', '2010-08-28 05:05:30', '2010-08-28 05:05:30', 1, 5, 1)